<!doctype php>
<html>
	<head>
		<meta charset="utf-8" />
		<title>Поисковые системы</title>
		<link rel="stylesheet" href="style/style.css" />
	</head>
	
	<body>
		<?php
			include 'menu.php';
		?>
		
		<div class="class_columns_wrapper">
			<a href="news.php">
				<div class="content_widget">
					<img src="images/news1.jpg" width="100%" />
					<p>Новый алгоритм в Яндекс, изменения выдачи и трафика в Google и другие новости</p>
				</div>
			</a>
		</div>
		<div class="class_columns_wrapper">
			<a href="doodles.php">
				<div class="content_widget">
					<img src="images/doodle.png" width="100%" />
					<p>Google Doodle — отличающиеся от стандартного логотипы поисковой системы Google, приуроченные к некоторому событию, празднику, годовщине. Doodle бывают как глобальные, отображаемые на всех доменах google, так и локальные, предназначенные для определённых государств.</p>
				</div>
			</a>
		</div>
		<div class="class_columns_wrapper">
			<a href="add.php">
				<div class="content_widget">
					<img src="images/add_news.jpg" width="100%" />
					<p>Добавить свою новость</p>
				</div>
			</a>
		</div>
		
		<div class="class_class_main_wrapper">
			<div class="article_wrapper">
				<div class="content_widget">
					<p>Поисковые каталоги (англ. search engine) — это компьютерная система, предназначенная для поиска информации. Одно из наиболее известных применений поисковых систем — веб-сервисы для поиска текстовой или графической информации во Всемирной паутине. Существуют также системы, способные искать файлы на FTP-серверах, товары в интернет-магазинах, информацию в группах новостей Usenet.</p>
					<p>Для поиска информации с помощью поисковой системы пользователь формулирует поисковый запрос. Работа поисковой системы заключается в том, чтобы по запросу пользователя найти документы, содержащие либо указанные ключевые слова, либо слова, как-либо связанные с ключевыми словами. При этом поисковая система генерирует страницу результатов поиска. Такая поисковая выдача может содержать различные типы результатов, например: веб-страницы, изображения, аудиофайлы. Некоторые поисковые системы также извлекают информацию из подходящих баз данных и каталогов ресурсов в Интернете.</p>
					<p>Поисковая система тем лучше, чем больше документов, релевантных запросу пользователя, она будет возвращать. Результаты поиска могут становиться менее релевантными из-за особенностей алгоритмов (см. «Пузырь фильтров») или вследствие человеческого фактора. По состоянию на 2015 год самой популярной поисковой системой в мире является Google, однако есть страны, где пользователи отдали предпочтение другим поисковикам. Так, например, в России «Яндекс» обгоняет Google больше, чем на 10%.</p>
				</div>
			</div>
		</div>
		
	</body>
</html>